
# State **`s3://infrahouse-website-infra/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        3 |           1 |          0 |
## Affected resources by action

|  Action  | Resources                                                           |
|:--------:|:--------------------------------------------------------------------|
|    🟢    | `module.website.aws_s3_bucket.access_log[0]`                        |
|    🟢    | `module.website.aws_s3_bucket_policy.access_logs[0]`                |
|    🟢    | `module.website.aws_s3_bucket_public_access_block.public_access[0]` |
|    🟡    | `module.website.aws_alb.website`                                    |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.website.data.aws_iam_policy_document.access_logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "access_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::027434742980:root",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.website.aws_alb.website will be updated in-place
  ~ resource "aws_alb" "website" {
        id                                                           = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/web20240913214119018400000001/899a5c5d81f7169f"
        name                                                         = "web20240913214119018400000001"
      ~ tags                                                         = {
          - "account"           = "493370826424"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "production"
          - "service"           = "website"
        } -> (known after apply)
      ~ tags_all                                                     = {
          - "account"           = "493370826424"
          - "created_by"        = "infrahouse/infrahouse-website-infra"
          - "created_by_module" = "infrahouse/website-pod/aws"
          - "environment"       = "production"
          - "service"           = "website"
        } -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ access_logs {
          + bucket  = (known after apply)
          ~ enabled = false -> true
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.website.aws_s3_bucket.access_log[0] will be created
  + resource "aws_s3_bucket" "access_log" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "web-access-log-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "production"
          + "service"           = "website"
        }
      + tags_all                    = {
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "production"
          + "service"           = "website"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.website.aws_s3_bucket_policy.access_logs[0] will be created
  + resource "aws_s3_bucket_policy" "access_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.website.aws_s3_bucket_public_access_block.public_access[0] will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS90ZXJyYWZvcm0udGZzdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJhZGQiOiAzLCAiY2hhbmdlIjogMSwgImRlc3Ryb3kiOiAwfX0=
```
</details>